#+title: JavaScript

[[file:../../../homepage.org][Homepage]] / [[file:../../../notes.org][Notes]] / [[file:../../computer-science.org][Computer Science]] / [[file:../languages.org][Programming Languages]] / JavaScript

** Strings
#+begin_src js :results output
console.log('Hello, World!')
#+end_src

#+RESULTS:
: Hello, World!

String concatenation:
#+begin_src js
return 'hello' + 'world'
#+end_src

#+RESULTS:
: helloworld

** Numbers
#+begin_src js
return 1 + 1
#+end_src

#+RESULTS:
: 2

** Arrays
#+begin_src js :results verbatim
return [1, 2, 3]
#+end_src

#+RESULTS:
: [ 1, 2, 3 ]

** Objects
#+begin_src js
return {key: 'value'}
#+end_src

#+RESULTS:
: { key: 'value' }

*** Basics
#+begin_src typescript
function hello(name) {
    return "hello " + name;
}

console.log(hello("world"));
#+end_src

#+RESULTS:
: ../../../../../var/folders/5j/jvlb0vrx4kl385s_yhg0h81w0000gn/T/babel-xhBADG/ts-src-P72lay.ts(1,16): error TS7006: Parameter 'name' implicitly has an 'any' type.
: hello world

#+begin_src typescript
function hello(name: string) {
    return "hello " + name;
}

console.log(hello("world"));
#+end_src

#+RESULTS:
: hello world

#+begin_src typescript
function hello(name: string) {
    return "hello " + name;
}

console.log(hello(2));
#+end_src

#+RESULTS:
: ../../../../../var/folders/5j/jvlb0vrx4kl385s_yhg0h81w0000gn/T/babel-xhBADG/ts-src-Rg1elh.ts(5,19): error TS2345: Argument of type 'number' is not assignable to parameter of type 'string'.
: hello 2

#+begin_src typescript
const obj = { name: "Damien", age: 28 };
obj.location;
#+end_src

#+RESULTS:
: ../../../../../var/folders/5j/jvlb0vrx4kl385s_yhg0h81w0000gn/T/babel-xhBADG/ts-src-NiBopQ.ts(2,5): error TS2339: Property 'location' does not exist on type '{ name: string; age: number; }'.

**** Type declaration on function parameter
#+begin_src typescript
function greet(name: string) {
    console.log("Hello, " + name.toUpperCase());
}

greet("Damien");
#+end_src

#+RESULTS:
: Hello, DAMIEN

#+begin_src typescript :results silent
function greet(name: string) {
    console.log("Hello, " + name.toUpperCase());
}

greet(42);
#+end_src

^ runtime error

**** Object Types
#+begin_src typescript
function printCoord(pt: { x: number; y: number }) {
  console.log(`${pt.x}, ${pt.y}`);
}

printCoord({ x: 9, y: 2 });
#+end_src

#+RESULTS:
: 9, 2

***** Optional Parameters
#+begin_src typescript
function printName(obj: { firstName: string; lastName?: string }) {
  console.log(`${obj.firstName}${obj.lastName}`);
}

printName({ firstName: "Damien" });
printName({ firstName: "Damien", lastName: "Gonot" });
#+end_src

#+RESULTS:
: Damienundefined
: DamienGonot

#+begin_src typescript
function printName(obj: { firstName: string; lastName?: string }) {
  if (obj.lastName !== undefined) {
    console.log(`${obj.firstName} ${obj.lastName}!`);
  } else {
    console.log(`${obj.firstName}!`);
  }
}

printName({ firstName: "Damien" });
printName({ firstName: "Damien", lastName: "Gonot" });
#+end_src

#+RESULTS:
: Damien!
: Damien Gonot!

**** Union Types
When a value could be any of multiple types.
#+begin_src typescript
function printId(id: number | string) {
  console.log("Your ID is: " + id);
}

printId(101);

printId("202");

printId({ myID: 22342 });
#+end_src

#+RESULTS:
: ../../../../../var/folders/5j/jvlb0vrx4kl385s_yhg0h81w0000gn/T/babel-xhBADG/ts-src-lKsnQz.ts(9,9): error TS2345: Argument of type '{ myID: number; }' is not assignable to parameter of type 'string | number'.
:   Type '{ myID: number; }' is not assignable to type 'number'.
: Your ID is: 101
: Your ID is: 202
: Your ID is: [object Object]

**** Type Aliases
#+begin_src typescript
type Point = {
  x: number;
  y: number;
};

function printCoord(pt: Point) {
  console.log("The coordinate's x value is " + pt.x);
  console.log("The coordinate's y value is " + pt.y);
}

printCoord({ x: 100, y: 100 });
#+end_src

#+RESULTS:
: The coordinate's x value is 100
: The coordinate's y value is 100

**** Interfaces
#+begin_src typescript
interface Point {
  x: number;
  y: number;
}

function printCoord(pt: Point) {
  console.log("The coordinate's x value is " + pt.x);
  console.log("The coordinate's y value is " + pt.y);
}

printCoord({ x: 100, y: 100 });
#+end_src

#+RESULTS:
: The coordinate's x value is 100
: The coordinate's y value is 100

**** Literal Types
#+begin_src typescript
function printDirection(s: "North" | "East" | "South" | "West") {
  console.log(s);
}

printDirection("North");
printDirection("South-West");
#+end_src

#+RESULTS:
: ../../../../../var/folders/5j/jvlb0vrx4kl385s_yhg0h81w0000gn/T/babel-xhBADG/ts-src-F4JdCD.ts(6,16): error TS2345: Argument of type '"South-West"' is not assignable to parameter of type '"North" | "East" | "South" | "West"'.
: North
: South-West

